#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.example: Refreshing state... [id=/subscriptions/b8d6bbe0-7512-40e7-880d-84ae976f0df2/resourceGroups/rg-terraform]
module.vnet.azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/b8d6bbe0-7512-40e7-880d-84ae976f0df2/resourceGroups/rg-terraform/providers/Microsoft.Network/virtualNetworks/example-vnet]
module.vnet.azurerm_subnet.example: Refreshing state... [id=/subscriptions/b8d6bbe0-7512-40e7-880d-84ae976f0df2/resourceGroups/rg-terraform/providers/Microsoft.Network/virtualNetworks/example-vnet/subnets/internal]
module.network_interface.azurerm_network_interface.example: Refreshing state... [id=/subscriptions/b8d6bbe0-7512-40e7-880d-84ae976f0df2/resourceGroups/rg-terraform/providers/Microsoft.Network/networkInterfaces/example-nic]
module.vm.azurerm_windows_virtual_machine.example: Refreshing state... [id=/subscriptions/b8d6bbe0-7512-40e7-880d-84ae976f0df2/resourceGroups/rg-terraform/providers/Microsoft.Compute/virtualMachines/example-virtm]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.example has been deleted
  - resource "azurerm_resource_group" "example" {
        id       = "/subscriptions/b8d6bbe0-7512-40e7-880d-84ae976f0df2/resourceGroups/rg-terraform"
      - location = "westeurope" -> null
      - name     = "rg-terraform" -> null
    }

  # module.network_interface.azurerm_network_interface.example has been deleted
  - resource "azurerm_network_interface" "example" {
      - id                            = "/subscriptions/b8d6bbe0-7512-40e7-880d-84ae976f0df2/resourceGroups/rg-terraform/providers/Microsoft.Network/networkInterfaces/example-nic" -> null
        name                          = "example-nic"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vnet.azurerm_subnet.example has been deleted
  - resource "azurerm_subnet" "example" {
      - id                                             = "/subscriptions/b8d6bbe0-7512-40e7-880d-84ae976f0df2/resourceGroups/rg-terraform/providers/Microsoft.Network/virtualNetworks/example-vnet/subnets/internal" -> null
        name                                           = "internal"
        # (7 unchanged attributes hidden)
    }

  # module.vnet.azurerm_virtual_network.example has been deleted
  - resource "azurerm_virtual_network" "example" {
        id                      = "/subscriptions/b8d6bbe0-7512-40e7-880d-84ae976f0df2/resourceGroups/rg-terraform/providers/Microsoft.Network/virtualNetworks/example-vnet"
      - name                    = "example-vnet" -> null
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-terraform"
    }

  # module.network_interface.azurerm_network_interface.example will be created
  + resource "azurerm_network_interface" "example" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westeurope"
      + mac_address                   = (known after apply)
      + name                          = "example-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-terraform"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.vm.azurerm_windows_virtual_machine.example will be created
  + resource "azurerm_windows_virtual_machine" "example" {
      + admin_password             = (sensitive value)
      + admin_username             = "adminuser"
      + allow_extension_operations = true
      + computer_name              = (known after apply)
      + enable_automatic_updates   = true
      + extensions_time_budget     = "PT1H30M"
      + hotpatching_enabled        = false
      + id                         = (known after apply)
      + location                   = "westeurope"
      + max_bid_price              = -1
      + name                       = "example-virtm"
      + network_interface_ids      = (known after apply)
      + patch_mode                 = "AutomaticByOS"
      + platform_fault_domain      = -1
      + priority                   = "Regular"
      + private_ip_address         = (known after apply)
      + private_ip_addresses       = (known after apply)
      + provision_vm_agent         = true
      + public_ip_address          = (known after apply)
      + public_ip_addresses        = (known after apply)
      + resource_group_name        = "rg-terraform"
      + size                       = "Standard_F2"
      + virtual_machine_id         = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2016-Datacenter"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # module.vnet.azurerm_subnet.example will be created
  + resource "azurerm_subnet" "example" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "internal"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-terraform"
      + virtual_network_name                           = "example-vnet"
    }

  # module.vnet.azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "example-vnet"
      + resource_group_name = "rg-terraform"
      + subnet              = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @Rollson, Action: `pull_request`, Working Directory: `infra`, Workflow: `Create Infra with Terraform`*